import pandas as pd
import numpy as np

labels_freq = {'现代': 4448, '推广页': 4162, '中景': 3897, '静态': 3591, '平静': 2776, '单人口播': 2258, '填充': 2156,
               '多人情景剧': 1981, '场景-其他': 1793, '配音': 1751, '喜悦': 1558, '手机电脑录屏': 1418, '极端特写': 1399,
               '特写': 1395, '室内': 1305, '动态': 1296, '家': 929, '惊奇': 926, '全景': 879, '亲子': 846, '室外': 783,
               '愤怒': 749, '教师(教授)': 712, '家庭伦理': 708, '拉近': 619, '教辅材料': 609, '朋友&同事(平级)': 592,
               '情景演绎': 575, '悲伤': 526, '夫妻&恋人&相亲': 508, '路人': 481, '办公室': 461, '手写解题': 434, '影棚幕布': 375,
               '工作职场': 345, '混剪': 336, '课件展示': 304, '转场': 280, '学校': 271, '宫格': 258, '上下级': 242, '拉远': 238,
               '单人情景剧': 212, '动画': 206, '知识讲解': 201, '汽车内': 189, '远景': 175, '亲戚(亲情)': 171, '过渡页': 166,
               '幻灯片轮播': 154, '(马路边的)人行道': 151, '才艺展示': 134, '商品展示': 114, '餐厅': 113, '红包': 112,
               '厌恶': 103, '图文快闪': 94, '绘画展示': 83, '城市道路': 77, '门口': 73, '重点圈画': 70, '游戏画面': 68,
               '采访': 66, '企业家': 61, '城市景观': 60, '多人口播': 58, '公园': 58, '商场': 47, '古代': 46, '古装/武侠': 44,
               '停车场': 44, '医院': 35, '演播室': 31, '房屋外': 29, '咖啡厅': 26, '励志逆袭': 25, '婆媳': 24, '过道': 22,
               '外卖': 21, '天空': 21, '大厅': 17, '医生': 16}
tagging_info_file = '../dataset/label_id.txt'

label2idx = {}
with open(tagging_info_file, 'r') as f:
    for line in f:
        line = line.strip()
        label = line.split('\t')[0]
        label_id = int(line.split('\t')[1])
        label2idx[label] = label_id

freq = np.zeros(shape=[82, ])

for label in labels_freq:
    idx = label2idx[label]
    freq[idx] = labels_freq[label]

neg_freq = 5000 - freq

res = {
    'class_freq': freq,
    'neg_class_freq': neg_freq
}

print(res)

pd.to_pickle(res, "../dataset/class_freq.pkl")
